[
  {
    "id": 1,
    "title": "The Balancing Act: Wearing All the Hats in Independent Production",
    "publishDate": "December 12, 2024",
    "content": "As an independent writer, producer, and editor, I’ve learned that juggling multiple roles is both a challenge and a superpower. On one hand, it’s empowering to oversee every step of the creative process—from shaping the story to seeing it come to life on screen. On the other, it demands constant switching between creative and logistical mindsets.\n\nWriting requires focus and imagination, producing demands organization and resourcefulness, and editing tests patience and precision. Each role is its own art, and balancing them often feels like a high-wire act. But the reward? Total creative ownership. The ability to bring a vision to life exactly as you imagined it.\n\nOne trick I’ve found helpful is time-blocking. I dedicate specific days or hours to each role so I can fully immerse myself without distractions. It’s not always perfect, but it helps keep the chaos manageable. To fellow creators out there, remember: it’s okay to ask for help when you need it. Collaboration can spark magic."
  },
  {
    "id": 2,
    "title": "From Script to Screen: How Writing Shapes the Entire Creative Process",
    "publishDate": "December 12, 2024",
    "content": "Every great project starts with a story, and as a writer, I know the script is the foundation of everything. It’s not just words on a page; it’s the blueprint for what’s to come. As someone who also produces and edits, I’ve found that strong writing simplifies everything that follows.\n\nWhen writing, I think like a producer: Can this scene be shot on my budget? Do I have the resources to make this vision a reality? And when I’m editing, I rely on the script as a guide, revisiting its beats to ensure the final cut stays true to the original intent.\n\nWearing all three hats has taught me the importance of flexibility. Sometimes, what works on paper doesn’t translate on set or in the edit bay. Adapting without losing the essence of the story is key. Writing isn’t just the first step—it’s a thread that runs through the entire process."
  }
  {
    "id": 3,
    "title": "Chromaphase",
    "publishDate": "2022",
    "content": `<a href="https://chromaphase.itch.io/existence">Chromaphase</a>`
  }
]
